# OrderedViewList Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InSessionViewSheetSet..::..OrderedViewList Property
InSessionViewSheetSet Class See Also
---
Ordered views.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual IReadOnlyList<View> OrderedViewList { get; set; }
```

Visual Basic
---
```text
Public Overridable Property OrderedViewList As IReadOnlyList(Of View)
	Get
	Set
```

Visual C++
---
```text
public:
virtual property IReadOnlyList<View^>^ OrderedViewList {
	IReadOnlyList<View^>^ get ();
	void set (IReadOnlyList<View^>^ value);
}
```

# ### Implements
IViewSheetSet..::..OrderedViewList
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the input ordered view list is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the set operation failed due to invalid view which cannot be printed. |

# See Also
InSessionViewSheetSet Class
Autodesk.Revit.DB Namespace